#include<stdio.h>
#include<locale.h>

int main()
{

	setlocale(LC_ALL, "RUS");
	int a, b;
	puts("____________________________");
	puts("|a*b| a+b| a-b|");
	puts("____________________________");
	printf("¬ведите 2 числа через пробел");
	scanf("%d %d", &a, &b);
	printf("_____________________________________________\n");
	printf(" |a*b| a+b| a-b|  \n");
	printf("_____________________________________________\n");
	printf("|% 6.d *% -5.d|% 6.d + %-5.d|% 6.d -% -5.d| \n", a, b, a, b, a, b);
	printf("_____________________________________________\n");
	printf("| % -6.d| % -6.d| % -6.d| \n", a * b, a + b, a - b);
	printf("_____________________________________________\n");
	}